### 🔧 Bootstrap Terraform Plan

<details>
<summary>点击展开 Plan 输出</summary>

```hcl
local_sensitive_file.ssh_key: Refreshing state... [id=f6bef8bf75abefb62ee12a1e5d4dc5fffd3bede3]
null_resource.k3s_server: Refreshing state... [id=127050603283306056]
kubernetes_namespace.bootstrap: Refreshing state... [id=bootstrap]
kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_namespace.platform: Refreshing state... [id=platform]
helm_release.cnpg_operator: Refreshing state... [id=cnpg]
cloudflare_record.wildcard_public: Refreshing state... [id=ad4c7065dfdc814f8fceb49ebe907ae4]
cloudflare_record.root: Refreshing state... [id=6af3d1fa49c3d911892f195a4c7fd6c4]
cloudflare_record.x_staging: Refreshing state... [id=994d200bafbce9b2e8c0c3d1b4536678]
cloudflare_record.infra_records["home"]: Refreshing state... [id=b3a26757041f1edd4d855554356d2084]
cloudflare_record.infra_records["kcloud"]: Refreshing state... [id=6f06ad93f69bd78245fdfe8a57ddd189]
cloudflare_record.infra_records["auth"]: Refreshing state... [id=76f911197685888fb53b7491a4ad5b1c]
cloudflare_record.infra_records["sso"]: Refreshing state... [id=70ad91913df52a16ec8902afdb9bb6e1]
cloudflare_record.infra_records["digger"]: Refreshing state... [id=9fc7192d978f4a4a56c099b4498369e4]
cloudflare_record.wildcard_internal[0]: Refreshing state... [id=d2abf7cd2683a09c2158d35e009219f7]
cloudflare_record.infra_records["k3s"]: Refreshing state... [id=34540150c83277063b0e8752aabbe4d3]
cloudflare_record.infra_records["signoz"]: Refreshing state... [id=5b90434833452b7d428d61c7d33c1263]
cloudflare_record.infra_records["kapi"]: Refreshing state... [id=281f5c2bf647990805ca894fc0631038]
cloudflare_record.infra_records["openpanel"]: Refreshing state... [id=96fe6a95fd7414d551adc36bdd9c3176]
cloudflare_record.infra_records["secrets"]: Refreshing state... [id=fd7459cadcd7cc6b278b3cf48a0b1398]
cloudflare_record.infra_records["kdashboard"]: Refreshing state... [id=8ed6a6305893dd0bdead535fd5d45016]
null_resource.kubeconfig: Refreshing state... [id=7352832925648048633]
kubernetes_secret.platform_pg_superuser: Refreshing state... [id=platform/platform-pg-superuser]
kubernetes_secret.cloudflare_api_token: Refreshing state... [id=cert-manager/cloudflare-api-token-secret]
helm_release.cert_manager: Refreshing state... [id=cert-manager]
data.local_file.kubeconfig: Reading...
data.local_file.kubeconfig: Read complete after 0s [id=e8e9d6301d5e9261409aef623945966463087ba8]
kubectl_manifest.traefik_config: Refreshing state... [id=/apis/helm.cattle.io/v1/namespaces/kube-system/helmchartconfigs/traefik]
kubernetes_config_map_v1.local_path_config: Refreshing state... [id=kube-system/local-path-config]
kubernetes_storage_class.local_path_retain: Refreshing state... [id=local-path-retain]
kubectl_manifest.local_path_provisioner_restart: Refreshing state... [id=/apis/apps/v1/namespaces/kube-system/deployments/local-path-provisioner]
kubectl_manifest.platform_pg: Refreshing state... [id=/apis/postgresql.cnpg.io/v1/namespaces/platform/clusters/platform-pg]
kubectl_manifest.cluster_issuer_letsencrypt_prod: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt-prod]
time_sleep.wait_for_platform_pg: Refreshing state... [id=2025-12-24T20:13:55Z]
helm_release.digger: Refreshing state... [id=digger]
kubectl_manifest.wildcard_certificate_public: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/cert-manager/certificates/wildcard-tls-public]
kubectl_manifest.wildcard_certificate_internal: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/cert-manager/certificates/wildcard-tls-internal]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.digger is tainted, so must be replaced
-/+ resource "helm_release" "digger" {
      ~ id                         = "digger" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v0.6.106"
              - chart          = "digger-backend"
              - first_deployed = 1766608733
              - last_deployed  = 1766608733
              - name           = "digger"
              - namespace      = "bootstrap"
              - revision       = 1
              - values         = jsonencode(
                    {
                      - digger   = {
                          - image     = {
                              - repository = "registry.digger.dev/diggerhq/digger_backend"
                              - tag        = "v0.6.101"
                            }
                          - ingress   = {
                              - annotations = {
                                  - "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
                                }
                              - className   = "traefik"
                              - enabled     = true
                              - host        = "digger.zitian.party"
                              - tls         = {
                                  - secretName = "digger-tls"
                                }
                            }
                          - postgres  = {
                              - database = "digger"
                              - host     = "platform-pg-rw.platform.svc.cluster.local"
                              - password = "Ld63FK25alvAwewa18YS85JMPwxzkt"
                              - port     = "5432"
                              - sslmode  = "disable"
                              - user     = "postgres"
                            }
                          - resources = {
                              - limits   = {
                                  - cpu    = "500m"
                                  - memory = "512Mi"
                                }
                              - requests = {
                                  - cpu    = "100m"
                                  - memory = "128Mi"
                                }
                            }
                          - secret    = {
                              - bearerAuthToken       = "53e55027f428157c41a628e89512cc352d247ad5a32c78ad747f4a5b94dac0a2"
                              - githubAppClientID     = "Ov23liHgsLcrcLZZigMh"
                              - githubAppClientSecret = "f35c288239df89eed74a3d9143fd66fb186eca2d"
                              - githubAppID           = "2421159"
                              - githubAppKeyFile      = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFb3dJQkFBS0NBUUVBNklpSzFhUFN1Y1FNOEJvbHNERXQwL3k2N0NUZCtSKzhvM0FrSHFWUDVrNC9rOTdWCk1zeW5kemYvb1I1YW1tbXJkcGg2Z0JoR0ovcW9JSEhjbFBTS3phL3RuVmJYUWZjWWF2dlBqTlZ4ZjlYc0hnTUsKbDVZMVlrQzV2MEhzaTh3THRzWWhvZ0ZQcUpFL2tjUmgvWi84R3VlMEFQY296VHZRcGFUa0FGMDBHcjRxSzNXQQpUaE9EeEp4VjVkUWRvZmhtWjY0TURXZUYyRERYeGZCaVdhcWs4MVl5dkNPZzl6SVdtK0ZnU2QwMEpaU0VZd0ZlCm5UN2ZFZ2pRV2JkSWdwNm1YWjVMK2Nyb090cTJJYlF1NWd6TTdUUmVUY3ZVUzc0UHhCbkFiMXBsK0pOb1ROb1kKcGVPUU51dzdGc2NNMmR2b2k2Si80Q2NEQlNzMTNuOSs2allmUndJREFRQUJBb0lCQVFEY0Q4eUVIc1BnZGo5ZwpRdjZEM2libXhma0lYbU9MenBNeGdZRk5WMWxrTlkxSm5jcmFobis5L2NyNGFjZUk5cFFFYW8wVUNPVHNGUFZqCnJ4MzRBZTRTZG5wRE90b0FYWjVJTVFMYzMycklkbVU4aWRoT1dTTXdWdHp5dWFycEtqT3p4NUl3eFZqanlJSUcKcTNtcEV1ejljV1lTdTlWclZUNUNaT2c1eC9yMWlsQnZyWXhvbDZjQnU1RlNJcXc0ZHhEVW5EcWxyRFJpUjB3dgpBN2JaeXBEUkJBM1hOM2xlUnoxc1JucU9LdFRYNnFRaVVLdHBjYzJzeTFJRWNjVmNRZ2kyS0c0Z3pmN0c2SFZJClFsYUtla2pZUzRReG45RWN2QjA4TDlUdWV3UGtrOENMRzQ2SlU4ZWoxNEhIcUxzbmlwNkZQT1ovZ2hqQU1IelQKdmZONitzN1JBb0dCQVBpVXRCQjNveEozZ1NacGIwWjQzWGxzNEJlbm5YTHV0ckF2THF6RnNSUkN4RGtoZFM2TQo0em5tRTNLeFNlSEpUZmI0NVYweU4ydVIydUtMVVFjUWxwajFFbXErbmxCelJHVks4ZTNnWms2ektxaGxFajdPCjhTU0lwT1pxMG1ib1VML0xKY01nbEZjQjdQR2pJVlhMdncvc0ttSER6OFpramdWVC9WeXIxWUN6QW9HQkFPOTUKT2lCbitoMTVDOENXY0ZyYnVYZnVkVzMvQklVZXJMRFFEbFdCdmQ2clllVEJPQitvbHkycGV0cHU0N3NYRzZJOAovZVJWczNtdWE2cHR4aUd3RkYxekNzOUJMdlNoTWhqL2ltM3hjbGNGUzF5VmRKRm1JSFlDRWhNR3dJakN4M1pVCkVkTXZYU3V2eWFGT2JEMU1qQlY0M01ITzhDdWU0akxHK1ZkVUhza2RBb0dBY1VFM0JPV3RLNFc5RnVZa3A2UDcKckEzNXoyMHpwQ0MwcFhMcHZoZllCUllpVnJFeXRZSEZLU1QxS1dVeTl5Y0RXWW11M3BZNWY4NFZQdkFnZTZxSQpJcXBOdU1xZVVLTWp2MDYxQ1I4YkhiSXR0a2xPVmNWdFFxcnJEbndPM29ucitHWXpEMEx4c3U2U3FNa2RML3pEClVSclZlSE9CWDYrQ3NWVEI4NDNxbVZjQ2dZQmJaZVJXZS9qTkNPY0FZU3FPc3UvdG96aDBlL0dJc1RWdDRtcW0KSGZlT3BkQ2VFMVROV0hZaXVsMm1RczV1R0pxMmFCcnE2LzZ0QVhJY1FQdHUzaHBYdEZHNjJvRUdZd09RNE84LwptUGh2MkJoMFJLS1IzKzJodkphVFptOVRneXZIc0x5QTRzSG5xNWNFRnI5ZkFma3hOTWprdTR1VXluWkF0UXB6ClZ5ck16UUtCZ0RVRXJsM3YwbzVlOWNWU3d1UnhjWThRZUJIUFRPWnZvNDZ6S2pLbjViM3VYMVgrU0hoS1pvek0KWHRnZjlOcVpqby9UUFo4M1NsYjVnUmZYOUNHb0hwUFh1aDZJYmRrc3JPVHhmalFaYnRwSy91WUQxNHJQVjByLwpTaHdHY3p0NEwzeWNycDg5bEcrWTFNSE5zSEYwMHR2cTgwcHJDOTA5TlhCOFRDdjREUVBzCi0tLS0tRU5EIFJTQSBQUklWQVRFIEtFWS0tLS0tCg=="
                              - githubOrg             = "wangzitian0"
                              - githubWebhookSecret   = "6d3cd8ae342c388c4f48b1f1824c3514c7ae3a9efe091afcd328eee95966a374"
                              - hostname              = "digger.zitian.party"
                              - httpBasicAuthPassword = "SGfUnC58rZw3WKkd"
                              - httpBasicAuthUsername = "admin"
                              - useExistingSecret     = false
                            }
                          - service   = {
                              - port = 3000
                              - type = "ClusterIP"
                            }
                        }
                      - postgres = {
                          - enabled = false
                        }
                    }
                )
              - version        = "0.1.12"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        name                       = "digger"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # kubectl_manifest.platform_pg will be updated in-place
  ~ resource "kubectl_manifest" "platform_pg" {
        id                      = "/apis/postgresql.cnpg.io/v1/namespaces/platform/clusters/platform-pg"
        name                    = "platform-pg"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: postgresql.cnpg.io/v1
            kind: Cluster
            metadata:
              labels:
                layer: Platform
              name: platform-pg
              namespace: platform
            spec:
              bootstrap:
                initdb:
                  database: vault
                  owner: postgres
                  postInitSQL:
                  - CREATE DATABASE casdoor;
                  - CREATE DATABASE digger;
                  - CREATE TABLE IF NOT EXISTS vault_kv_store (parent_path TEXT COLLATE "C" NOT
                    NULL, path TEXT COLLATE "C", key TEXT COLLATE "C", value BYTEA, CONSTRAINT
                    pkey PRIMARY KEY (path, key));
                  - CREATE INDEX IF NOT EXISTS parent_path_idx ON vault_kv_store (parent_path);
                  - CREATE TABLE IF NOT EXISTS vault_ha_locks (ha_key TEXT COLLATE "C" NOT NULL,
                    ha_identity TEXT COLLATE "C" NOT NULL, ha_value TEXT COLLATE "C", valid_until
                    TIMESTAMP WITH TIME ZONE NOT NULL, CONSTRAINT ha_key PRIMARY KEY (ha_key));
          +   enableSuperuserAccess: true
              instances: 1
              monitoring:
                enablePodMonitor: false
              postgresql:
                parameters:
                  effective_cache_size: 256MB
                  max_connections: "100"
                  shared_buffers: 128MB
                  wal_level: replica
              resources:
                limits:
                  cpu: 500m
                  memory: 512Mi
                requests:
                  cpu: 100m
                  memory: 128Mi
              storage:
                size: 10Gi
                storageClass: local-path-retain
              superuserSecret:
                name: platform-pg-superuser
        EOT
        # (14 unchanged attributes hidden)
    }

  # kubernetes_secret.platform_pg_superuser must be replaced
-/+ resource "kubernetes_secret" "platform_pg_superuser" {
      ~ id                             = "platform/platform-pg-superuser" -> (known after apply)
      - immutable                      = false -> null
      ~ type                           = "Opaque" -> "kubernetes.io/basic-auth" # forces replacement
        # (4 unchanged attributes hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "platform-pg-superuser"
          ~ resource_version = "2430568" -> (known after apply)
          ~ uid              = "dc6b09f7-90ac-43ed-93ac-b0699fd906de" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # local_sensitive_file.ssh_key will be created
  + resource "local_sensitive_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "/tmp/infra-k3s.id_rsa"
      + id                   = (known after apply)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
</details>

> To apply: comment `/bootstrap apply`